<template>
  <div class="Home" style="width: 100%;">
    <Navbar />
    <div class="container">
      <div class="logo-container">
        <img id="logo" src="../assets/logo/logo.png" />
      </div>
      <hr />
      <div class="thai pl-3 pr-2 mb-5">
        <h3 class="font-weight-bold">Terms and conditions</h3>
        <p class="pl-5 pr-5">
          &emsp;&emsp;เอกสารหรือบทความต่อไปนี้คือข้อบรรยายที่แจ้งถึงลักษณะของผลิตภัณฑ์ให้ลูกค้าหรือผู้ใช้บริการได้ทราบและตกลงโดยร่วมกัน
          เนื่องจากการเข้าถึงประสิทธิภาพของฟีเจอร์ต่างๆในแฟลตฟอร์มอันเป็นกรรมสิทธิ์ของทางบริษัท ลูกค้า, ผู้ซื้อ, ผู้ใช้บริการของทางบริษัท
          จำเป็นต้องรับรู้ลักษณะของผลิตภัณฑ์และเข้าใจถึงข้อยินยอมต่างๆ อันได้แก่ การให้สิทธิ์การเข้าถึงข้อมูล,
          การยินยอมปฎิบัติตามกฏระเบียบและข้อบังคับเมื่อลงทะเบียนใช้งานผลิตภัณฑ์,
          การยอมรับถึงข้อตกลงการซื้อใช้บริการทางธุรกิจตามที่บริษัทกำหนด,
          การมอบสิทธิ์การใช้งานข้อมูลส่วนบุคคลตามข้อตกลงที่บริษัทกำหนด รวมถึงการขอสงวนสิทธิ์ในหัวข้อบางประการ
        </p>
        <h5 class="font-weight-bold">รูปแบบของผลิตภัณฑ์และบริการของทางบริษัท</h5>
        <p class="pl-5 pr-5">
          &emsp;&emsp;ภายใต้เครื่องหมายการค้า MOVER ซึ่งนำเสนอผลิตภัณฑ์เกี่ยวกับภาคบริการทางด้านการการศึกษา
          และมีความเกี่ยวข้องกับระบบการทำงานของบุคคลากรหรือตัวนักเรียนนักศึกษา ซึ่งมีขอบข่ายงานปฏิบัติหน้าที่อยู่ในสถานศึกษาต่างๆ
          จุดประสงค์เพื่อทำเทคโนโลยีทันสมัย มาพัฒนาปรับปรุงระบบการจัดการของสถานศึกษา อันจะนำมาซึ่งประสิทธิภาพการทำงานที่เพิ่มขึ้น
          ทั้งตัวระบบและโดยรวม
        </p>
        <h5 class="mt-4 font-italic">นโยบายด้านการดำเนินธุรกิจ และการปฏิบัติงาน</h5>
        <ul class="pl-5 pr-5">
          <li>บริษัทขอสงวนสิทธิ์ที่จะเปลี่ยนแปลงข้อตกลงและเงื่อนไขการใช้บริการโดยไม่จำเป็นต้องแจ้งให้ผู้ใช้ได้ทราบล่วงหน้า</li>
          <li>
            บริษัทขอสงวนสิทธิ์การแบน หรือจำกัดการเข้าถึงบริการของผู้ใช้บริการผู้ใดก็ตาม ที่ไม่ปฏิบัติตามกฏข้อบังคับ หรือละเมิดข้อตกลงที่ทางผู้ให้บริการได้กำหนดไว้
            โดยไม่จำเป็นต้องแจ้งเหตุผลและระยะเวลาการจำกัดการอนุญาตการเข้าถึงให้กับผู้ใช้บริการได้รับทราบล่วงหน้า
          </li>
        </ul>
        <h5 class="mt-4 font-italic">ข้อตกลงการซื้อบริการ จากผู้ใช้บริการ</h5>
        <ul class="pl-5 pr-5">
          <li>
            ผู้ใช้บริการ จำเป็นต้องทำการซื้อหรือแลกเปลี่ยนอันใดก็ตามอันจะนำมาซึ่งการมอบสิทธ์การเข้าถึงบริการของทางบริษัท
            ตามแต่ที่ผู้ใช้บริการและบริษัทจะทำการตกลงและยอมรับซึ่งกันและกัน ทางบริษัทขอสงวนสิทธิ์ในการกำหนดและเปลี่ยนแปลงข้อตกลงทางธุรกิจ
            การซื้อขาย และการแลกเปลี่ยนโดยไม่จำเป็นต้องแจ้งให้ผู้ใช้บริการได้ทราบล่วงหน้า
          </li>
        </ul>
        <h5
          class="mt-4 font-italic"
        >ข้อตกลงเกี่ยวกับการใช้บริการ ข้อตกลงทางด้านความประพฤติของเจ้าของบัญชีและผู้ใช้</h5>
        <ul class="pl-5 pr-5">
          <li>ผู้ใช้บริการยินยอมที่จะไม่ป้อนหรือนำข้อมูลอันเป็นเท็จซึ่งมีผลกระทบกับการทำงานระบบโดยรวมของผลิตภัณฑ์ Mover</li>
          <li>ผู้ใช้บริการยินยอมที่จะไม่ป้อน หรือนำข้อมูลในรูปแบบใดๆที่มีความผิดทาง หรือละเมิดกฏหมายทั้งทางแพ่งและอาญา เข้าสู่ระบบการทำงานของผลิตภัณฑ์</li>
          <li>ผู้ใช้บริการยินยอมที่จะไม่ป้อน หรือนำข้อมูลในรูปแบบใดๆที่เกี่ยวข้องหรือสื่อไปในทางลามกอนาจารทุกรูปแบบ ทั้งชุดภาพ วีดีโอ และข้อความ</li>
          <li>ผู้ใช้บริการยินยอมที่จะไม่ป้อน หรือนำข้อมูลในรูปแบบใดๆอันเป็นการหมิ่นซึ่งตัวบุคคล, หมิ่นสถาบันระมหากษัตริย์</li>
          <li>ผู้ใช้บริการยินยอมที่จะไม่ป้อน หรือนำข้อมูลในรูปแบบใดๆที่มีจุดประสงค์ไปในทางยุยงปลุกปั่นหรือเจตนาให้เกิดการทะเลาะวิวาท</li>
          <li>
            ผู้ใช้บริการรับทราบว่า การกระทำผิดและละเมิดกฎหมายของทางผู้ใช้บริการนั้น ทางบริษัทไม่มีส่วนเกี่ยวข้องกับการกระทำนั้นๆ ไม่ว่าด้วยเหตุใดก็ตาม
            ผู้ใช้จะต้องรับผิดชอบแต่เพียงผู้เดียว และจะต้องรับผิดชอบต่อความเสียหายอันเกิดกับบริษัทและผลิตภัณฑ์ของบริษัท
          </li>
        </ul>
        <h5 class="mt-4 font-italic">ข้อตกลงเกี่ยวกับสิทธิ์การเข้าถึงของข้อมูลผู้ใช้บริการ</h5>
        <ul class="pl-5 pr-5">
          <li>
            ผู้ใช้บริการยินยอมมอบสิทธิ์การเข้าถึงข้อมูลรูปแบบใดๆก็ตามของผู้ใช้บริษัทสามารถเข้าถึงข้อมูลบัญชี และรูปภาพ วีดีโอ ข้อความ
            การระบุและติดตามตำแหน่งที่อยู่ หรือข้อมูลรูปแบบใดๆก็ตามที่ผู้ใช้ได้ทำการป้อนหรือนำเข้ามาภายในแพลตฟอร์มโดยทั้งตั้งใจและไม่ได้ตั้งใจ
            รวมทั้งการนำเข้าข้อมูลแบบทางตรงและทางอ้อมอันเกิดจากการกระทำของผู้ใช้บริการเอง
          </li>
          <li>
            การเข้าถึงข้อมูลในแพลตฟอร์มที่เกี่ยวข้องกับการให้บริการของบริษัท ผู้ใช้บริการยินยอมมอบสิทธิ์การเข้าถึงข้อมูลในรูปแบบใดๆก็ตามของผู้ใช้
            ที่ได้ทำการป้อนหรือนำเข้ามาในแพลตฟอร์มที่เกี่ยวข้องหรือบริการที่เกี่ยวข้องหรือผลิตภัณฑ์ข้างเคียงที่ได้ทำการเชื่อมต่อเพื่อแชร์หรือโอนถ่ายข้อมูลและทำกิจกรรมต่างๆร่วมกัน
          </li>
          <li>
            บริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงข้อตกลงเกี่ยวกับสิทธิ์การเข้าถึงของข้อมูลผู้ใช้บริการโดยไม่จำเป็นต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า
            และจะถือว่าผู้ใช้บริการได้รับทราบและยินยอมตามข้อตกลงเมื่อใช้บริการ
          </li>
        </ul>
        <h5 class="mt-4 font-italic">นโยบายด้านการใช้งานข้อมูลของผู้ใช้บริการ</h5>
        <ul class="pl-5 pr-5">
          <li>บริษัทจะไม่เปิดเผยข้อมูลส่วนตัวของผู้ใช้บริการสู่พื้นที่สาธารณะ ทั้งในรูปแบบแพลตฟอร์มออนไลน์และออฟไลน์โดยมิได้รับการอนุณาตจากผู้ใช้บริการก่อน</li>
          <li>บริษัทจะไม่เปิดเผยหรืออนุญาติให้บริษัทหรือบริการในแพลตฟอร์มที่ไม่มีส่วนเกี่ยวข้องกับผลประโยชน์และประสิทธิภาพการให้บริการเข้ามาเชื่อมต่อ หรือโอนถ่ายข้อมูล</li>
          <li>
            การเก็บและใช้งานข้อมูลต่างๆของผู้บริโภค มีจุดประสงค์เพื่อนำไปพัฒนาคุณภาพของผลิตภัณฑ์เพื่อนำเสนอและมอบคุณค่า
            เพื่อเพิ่มคุณภาพประสบการณ์ของผู้ใช้บริการให้ดียิ่งขึ้น
          </li>
          <li>ผู้ใช้บริการยินยอมที่จะไม่ป้อน หรือนำข้อมูลในรูปแบบใดๆอันเป็นการหมิ่นซึ่งตัวบุคคล, หมิ่นสถาบันระมหากษัตริย์</li>
          <li>ผู้ใช้บริการยินยอมที่จะไม่ป้อน หรือนำข้อมูลในรูปแบบใดๆที่มีจุดประสงค์ไปในทางยุยงปลุกปั่นหรือเจตนาให้เกิดการทะเลาะวิวาท</li>
          <li>
            ผู้ใช้บริการรับทราบว่า การกระทำผิดและละเมิดกฎหมายของทางผู้ใช้บริการนั้น ทางบริษัทไม่มีส่วนเกี่ยวข้องกับการกระทำนั้นๆ ไม่ว่าด้วยเหตุใดก็ตาม
            ผู้ใช้จะต้องรับผิดชอบแต่เพียงผู้เดียว และจะต้องรับผิดชอบต่อความเสียหายอันเกิดกับบริษัทและผลิตภัณฑ์ของบริษัท
          </li>
        </ul>
        <h5 class="mt-4 font-italic">ข้อตกลงเกี่ยวกับสิทธิ์การใช้งานข้อมูล</h5>
        <ul class="pl-5 pr-5">
          <li>
            ผู้ใช้บริการยินยอมให้บริษัทใช้งานข้อมูลบัญชี และรูปภาพ วีดีโอ ข้อความ การระบุและติดตามตำแหน่งที่อยู่
            หรือข้อมูลรูปแบบใดๆก็ตามที่ผู้ใช้ได้ทำการป้อนหรือนำเข้ามาภายในแพลตฟอร์มโดยทั้งตั้งใจและไม่ได้ตั้งใจ
            ทั้งทางตรงและทางอ้อมอันเกิดจากการกระทำของผู้ใช้บริการเอง เพื่อวิเคราะห์และพัฒนาคุณภาพการบริการของผลิตภัณฑ์
          </li>
          <li>
            ผู้ใช้บริการยินยอมให้บริษัทนำข้อมูลใดๆของผู้ใช้บริการไปจัดเรียง วิเคราะห์ และทำการโอนถ่ายหรือแชร์ไปยังระบบการทำงานที่เกี่ยวข้อง
            เพื่อทำการพัฒนาผลิตภัณฑ์และบริการของบริษัท
          </li>
          <li>
            ผู้ใช้บริการที่ได้ป้อนหรือนำเข้าข้อมูลในรูปแบบใดๆก็ตามเข้ามาในระบบการบริการของทางบริษัท ผู้ใช้บริการนั้นยินยอมให้สิทธิ์บริษัท
            เก็บ โอนถ่าย ทำสำเนา จัดเรียง วิเคราะห์ เปลี่ยนแปลง ลบข้อมูล ตามแต่นโยบายของผู้ให้บริการจะกำหนด
          </li>
          <li>
            ผู้ใช้บริการยินยอมให้สิทธิ์บริษัทเผยแพร่หรือโอนถ่ายข้อมูลของผู้ใช้บริการที่เกี่ยวข้องกับการทำงานของผลิตภัณฑ์
            ไปสู่ระบบการทำงานของผลิตภัณฑ์ที่เกี่ยวข้อง
          </li>
          <li>
            บริษัทขอสงวนสิทธิ์ในการเปลี่ยนแปลงข้อตกลงเกี่ยวกับสิทธิ์การใช้งานข้อมูลโดยไม่จำเป็นต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า
            และจะถือว่าผู้ใช้บริการได้รับทราบและยินยอมตามข้อตกลงเมื่อใช้บริการ
          </li>
        </ul>
        <div class="d-flex justify-content-center flex-column">
          <div class="custom-control custom-checkbox mt-3">
            <input
              id="terms"
              type="checkbox"
              class="custom-control-input"
              v-model="isAccept"
            />
            <label
              style="font-size:12pt;"
              class="thai custom-control-label"
              for="terms"
            >
              ฉันยอมรับข้อตกลงการใช้งาน
            </label>
          </div>
          <div class="btn-group">
            <button
              type="button"
              id="registerBtn"
              class="btn thai"
              :class="{ 'disabled': !isAccept }"
              @click="register"
              :disabled="!isAccept"
            >สมัครสมาชิก</button>
            <button type="button" id="back" class="btn thai" @click="cancel">ยกเลิก</button>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import Navbar from '../components/Home/Navbar-Terms'
export default {
  components: {
    Navbar
  },
  data () {
    return {
      isAccept: false
    }
  },
  methods: {
    cancel () {
      this.$router.go(-1)
    },
    register () {
      this.$router.replace({ name: 'register', params: this.$route.params })
    }
  }
}
</script>

<style scoped>
.logo-container {
  display: flex;
  justify-content: center;
  margin: 10px 0 10px 0;
  width: 100%;
}
#logo {
  width: 50px;
}
.btn {
  margin: 10px 0 0 0;
  color: white;
  border-radius: 18px !important;
  background: linear-gradient(
    180deg,
    rgba(33, 149, 186, 1) 0%,
    rgba(27, 127, 158, 1) 100%
  ) !important;
}
#registerBtn {
  width: 100%;
}
</style>
